In [3]:
import pandas as pd
import numpy as np

### 1. Define the Pandas/Python pandas?

Pandas is an open source Python package that is most widely used for data science/data analysis and machine learning tasks.  
1. Pandas is open source library ehich basically designed to work with relational or lebeled data  
2. it provides various data structure and operation for numerical data and time serious  
3. pandas can store heterogeneous data  
4. it support series and data frame structure  
5. it analysed the data

#### 2. What are the different types of Data Structures in Pandas?

1. Series - 1D
2. Dataframe - 2D

3. Explain Series and DataFrame In Pandas

DataFrame => It is 2-D dimension data structure
tables with rows and column
series Data structure => It is one dimension data

#### 4. How Can You Create An Empty DataFrame and series in Pandas?

In [4]:
df=pd.DataFrame()
print(df)
s=pd.Series()
print(s)

Empty DataFrame
Columns: []
Index: []
Series([], dtype: float64)

C:\Users\manoj\AppData\Local\Temp/ipykernel_6348/1741164444.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s=pd.Series()

#### 5. How to check empty DataFrame?

In [6]:
df=pd.DataFrame()
if df.empty:
    print('yes, DF is empty')
else:
    print('DF is not empty')

yes, DF is empty

#### 6. How to check empty DataFrame?6. What Are The Most Important Features Of The Pandas Library?

1. Handling of data
2. Handling missing data
3. cleaning up data
4. alignment and indexing
5. input and output tools
6. support time series
7. python support
8. grouping
9. perform mathematical operation on data
10. Label-based slicing, indexing and subsetting of large data sets.
11. Columns from a data structure can be deleted or inserted.
12. Group by data for aggregation and transformations.
13. High performance merging and joining of data.

#### 7. How to check empty DataFrame?7. How Will You Explain Reindexing In Pandas?

1. Reindexing changes the row lables and columns lables of a DataFrame.
2. To reindex means to confirm the data to match an given set of lables along a perticular axis.
3. we can reorder the existing data to match a new set of lables.

#### 8. What are the different ways of creating DataFrame in pandas? Explain with examples.

In [5]:
# by passing list
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([5,6,7,8,9])
df = pd.DataFrame([s1,s2])
df

   0  1  2  3  4
0  1  2  3  4  5
1  5  6  7  8  9

In [7]:
# By passing dictionary
s1 = ({"Numbers":[i for i in range (1,6)],
"Squares":[i**2 for i in range (1,6)],
"cube": [i**3 for i in range (1,6)]})
df1 = pd.DataFrame(s1)
df1

   Numbers  Squares  cube
0        1        1     1
1        2        4     8
2        3        9    27
3        4       16    64
4        5       25   125

In [8]:
#By pasing array:
l1 = np.array([1,2,3,4,5])
l2 = np.array([10,20,30,40,50])
df1 = pd.DataFrame([l1,l2])
df1

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50

#### 9. Create a DataFrame using List.

In [13]:
l1 = [1,2,3,4,5,6]
l2 = [9,8,7,6,5,8]
df = pd.DataFrame(l1,l2)
df

   0
9  1
8  2
7  3
6  4
5  5
8  6

In [12]:
l1 = [1,2,3,4,5,6]
l2 = [9,8,7,6,5,8]
df = pd.DataFrame([l1,l2])
df

   0  1  2  3  4  5
0  1  2  3  4  5  6
1  9  8  7  6  5  8

#### 10. Create a DataFrame using Numpy Functions.

In [14]:
array1 = np.array([[1,2,3,4,5],[6,7,8,9,5]])
array1
df = pd.DataFrame(array1)
df

   0  1  2  3  4
0  1  2  3  4  5
1  6  7  8  9  5

#### 11. How to convert a NumPy array to a DataFrame of a given shape?

In [15]:
array1 = np.array([[1,2,3,4,5],[6,7,8,9,5]])
array1
df = pd.DataFrame(array1)
df

   0  1  2  3  4
0  1  2  3  4  5
1  6  7  8  9  5

#### 12. Create a DataFrame using Dictionary with a list and arrays.

In [16]:
dict1 = {'List':[1,2,3,4,5],
'array':np.array([1,2,3,4,5])}
df = pd.DataFrame(dict1)
df

   List  array
0     1      1
1     2      2
2     3      3
3     4      4
4     5      5

#### 13. How To Create A Copy Of The Series and DataFrame in Pandas?

In [19]:
series = pd.DataFrame([1,2,3,4,5])
series
shallow_copy = series.copy(deep=False)
shallow_copy

   0
0  1
1  2
2  3
3  4
4  5

In [21]:
deep_copy = series.copy(deep=True)
deep_copy

   0
0  1
1  2
2  3
3  4
4  5

#### 14. How Will You Add An Index, Row, Or Column To A DataFrame In Pandas?

##### Adding Column to DataFrame

In [3]:
# import numpy as np
# import pandas as pd
# ar1 = np.random.randint(10,100,size = [4,3])
# df = pd.DataFrame(ar1, columns = ['Column_1', 'Column_2', 'Column_3'], index = list('ABCD'))
# new = {'Column_1': 100, 'Column_2': 200, 'Column_3':300}
# df = df.append(new, ignore_index = True)
# df
import numpy as np
import pandas as pd
ar1 = np.random.randint(10,100,size = [4,3])
df = pd.DataFrame(ar1, columns = ['Column_1', 'Column_2', 'Column_3'])
df['New_col'] = [10,20,30,40]
df

   Column_1  Column_2  Column_3  New_col
0        93        10        99       10
1        63        26        39       20
2        72        80        17       30
3        23        83        76       40

##### Adding index to DataFrame

In [5]:
import numpy as np
import pandas as pd
ar1 = np.random.randint(10,100,size = [4,3])
df = pd.DataFrame(ar1, columns = ['Column_1', 'Column_2', 'Column_3'], index = list('ABCD'))
df

   Column_1  Column_2  Column_3
A        90        46        97
B        80        69        85
C        47        67        73
D        88        54        90

#### Q15. What Method Will You Use To Rename The Index Or Columns Of Pandas DataFrame?

In [5]:
import numpy as np
import pandas as pd
arr1 = np.array([[1,1,1],[2,4,8],[3,9,27],[4,16,64],[5,25,125]])
df = pd.DataFrame(arr1, columns=['Number','Square','Cube'], index=['row1','row2','row3','row4','row5'])
df

      Number  Square  Cube
row1       1       1     1
row2       2       4     8
row3       3       9    27
row4       4      16    64
row5       5      25   125

In [12]:
df = df.rename({'Number':'NUMBER','Square':'SQUARE','Cube':'CUBE'},axis=1)
df

      NUMBER  SQUARE  CUBE
row1       1       1     1
row2       2       4     8
row3       3       9    27
row4       4      16    64
row5       5      25   125

In [13]:
df = df.rename({'row3':'AAA','row5':'BBB'})
df

      NUMBER  SQUARE  CUBE
row1       1       1     1
row2       2       4     8
AAA        3       9    27
row4       4      16    64
BBB        5      25   125

#### 16. How Can You Iterate Over DataFrame In Pandas?

In [5]:
import numpy as np
import pandas as pd
data = {'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka'],
    'Age': [21, 19, 20, 18],
    'Stream': ['Math', 'Commerce', 'Arts', 'Biology'],
    'Percentage': [88, 92, 95, 70]}
# Convert the dictionary into DataFrame
df = pd.DataFrame(data, columns = ['Name', 'Age', 'Stream', 'Percentage'])
print("Given Dataframe :\n", df)
print("\nIterating over rows using index attribute :\n")
# iterate through each row and select
# 'Name' and 'Stream' column respectively.
for ind in df.index:
    print(df['Name'][ind], df['Stream'][ind])
for ind in df.index:
    print(ind)

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

Iterating over rows using index attribute :

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology
0
1
2
3

#### 16. How Can You Iterate Over DataFrame In Pandas?

In [6]:
a1 = [['Sneha',27],['Ashwini',25],['naved',24]]

df = pd.DataFrame(a1,index=list('ABC'),columns =['Name','Age'])
df

      Name  Age
A    Sneha   27
B  Ashwini   25
C    naved   24

In [8]:
for i,item in df.iteritems():
    print(i)
    print(item)
    print('*******')

Name
A      Sneha
B    Ashwini
C      naved
Name: Name, dtype: object
*******
Age
A    27
B    25
C    24
Name: Age, dtype: int64
*******

#### 17. How to create an array from DataFrame

In [2]:
import numpy as np
import pandas as pd
arr1 = np.array([[1,1,1],[2,4,8],[3,9,27],[4,16,64],[5,25,125]])
df = pd.DataFrame(arr1, columns=['Number','Square','Cube'], index=['row1','row2','row3','row4','row5'])
df

      Number  Square  Cube
row1       1       1     1
row2       2       4     8
row3       3       9    27
row4       4      16    64
row5       5      25   125

In [2]:
df.to_numpy()

array([[  1,   1,   1],
       [  2,   4,   8],
       [  3,   9,  27],
       [  4,  16,  64],
       [  5,  25, 125]])

#### 18. How to create a list from DataFrame

In [3]:
df.to_numpy().tolist()

[[1, 1, 1], [2, 4, 8], [3, 9, 27], [4, 16, 64], [5, 25, 125]]

#### 19. How to Reset the dataframes index?

In [6]:
df=pd.DataFrame({'A':[1,2,3,4,5],'B':[10,20,30,40,50],'C':['a','b','c','d','e']})
df

   A   B  C
0  1  10  a
1  2  20  b
2  3  30  c
3  4  40  d
4  5  50  e

In [8]:
df.set_index('C')

   A   B
C
a  1  10
b  2  20
c  3  30
d  4  40
e  5  50

In [11]:
df.reset_index(drop=True)

   A   B  C
0  1  10  a
1  2  20  b
2  3  30  c
3  4  40  d
4  5  50  e

#### 20. Write a Pandas program to count the number of rows and columns of a DataFrame

In [15]:
df=pd.DataFrame({'A':[1,2,3,4,5],'B':[10,20,30,40,50],'C':['a','b','c','d','e']})
print('#Columns:',df.shape[0])
print('#Rows:',df.shape[1])

#Columns: 5
#Rows: 3

#### 21. Write a Pandas program to add, subtract, multiple, and divide two Pandas Series

In [2]:
import numpy as np
import pandas as pd
arr = np.random.randint(1,10, size=(5,2))
arr

array([[3, 9],
       [5, 8],
       [7, 4],
       [1, 7],
       [7, 6]])

In [6]:
df = pd.DataFrame(arr, columns=['A','B'])
df

   A  B
0  3  9
1  5  8
2  7  4
3  1  7
4  7  6

In [15]:
df['C'] = df['A'] + df['B']
df['D'] = df['C'] - 4
df['E'] = df['D'] * 5
df['F'] = df['E'] //3
df

   A  B   C  D   E   F
0  3  9  12  8  40  13
1  5  8  13  9  45  15
2  7  4  11  7  35  11
3  1  7   8  4  20   6
4  7  6  13  9  45  15

#### 22. Write a Pandas program to import excel data into a Pandas dataframe

In [4]:
df = pd.read_csv('Emp_Records1.csv')
df

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

#### 23. Write a Pandas program to read specific columns from a given excel file

In [7]:
df = pd.read_csv('Emp_Records1.csv')
df

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [9]:
df[['Emp ID']]

    Emp ID
0   677509
1   940761
2   428945
3   408351
4   193819
..     ...
95  639892
96  704709
97  461593
98  392491
99  495141

[100 rows x 1 columns]

#### 24. Write a Pandas program to find the sum, mean, max, min value of

In [10]:
df.describe()

             Emp ID  Age in Yrs  Weight in Kgs  Age in Company         Salary
count     100.00000  100.000000     100.000000      100.000000     100.000000
mean   547652.10000   39.238700      58.080000        8.978400  119738.090000
std    257664.16679   12.066252      12.294106        8.657358   46185.278194
min    134841.00000   21.100000      40.000000        0.020000   42005.000000
25%    328643.75000   28.177500      50.000000        2.152500   83979.750000
50%    497414.00000   37.595000      56.000000        6.435000  118049.500000
75%    766040.00000   49.900000      61.250000       13.762500  162509.250000
max    979607.00000   59.470000      90.000000       34.520000  197537.000000

#### 25. How Can A DataFrame Be Converted To An Excel File and CSV file?

In [11]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'ASCII values':np.arange(66,72),
'Char':[chr(i) for i in range(66,72)]})
print(df)
df.to_excel('ASCII_Values.xlsx')
df.to_csv('ASCII_Values.csv')

   ASCII values Char
0            66    B
1            67    C
2            68    D
3            69    E
4            70    F
5            71    G

#### 26. What is Groupby Function In Pandas? Explain with example

In [ ]:
GroupBy() function is used to collect the identical data into groupds
and perform aggregate fun on the grouped data.
Syntax: df.groupby()
df.groupby().first()
df.groupby().get_group()

In [12]:
import pandas as pd
movies = pd.read_csv('movies_data.csv')
movies

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [13]:
movies.groupby('star_rating').first()

,title,content_rating,genre,duration,actors_list
star_rating,,,,,
7.4,Man on the Moon,R,Biography,118,"[u'Jim Carrey', u'Danny DeVito', u'Gerry Becker']"
7.5,"Good Night, and Good Luck.",PG,Drama,93,"[u'David Strathairn', u'George Clooney', u'Pat..."
7.6,127 Hours,R,Adventure,94,"[u'James Franco', u'Amber Tamblyn', u'Kate Mara']"
7.7,Remember the Titans,PG,Biography,113,"[u'Denzel Washington', u'Will Patton', u'Wood ..."
7.8,Tombstone,R,Action,130,"[u'Kurt Russell', u'Val Kilmer', u'Sam Elliott']"
7.9,Birdman: Or (The Unexpected Virtue of Ignorance),R,Comedy,119,"[u'Michael Keaton', u'Zach Galifianakis', u'Ed..."
8.0,Rope,PG,Crime,80,"[u'James Stewart', u'John Dall', u'Farley Gran..."
8.1,Kingsman: The Secret Service,R,Action,129,"[u'Colin Firth', u'Taron Egerton', u'Samuel L...."
8.2,The Wolf of Wall Street,R,Biography,180,"[u'Leonardo DiCaprio', u'Jonah Hill', u'Margot..."
8.3,The Treasure of the Sierra Madre,NOT RATED,Action,126,"[u'Humphrey Bogart', u'Walter Huston', u'Tim H..."
8.4,M,NOT RATED,Crime,99,"[u'Peter Lorre', u'Ellen Widmann', u'Inge Land..."
8.5,The Green Mile,R,Crime,189,"[u'Tom Hanks', u'Michael Clarke Duncan', u'Dav..."
8.6,Life Is Beautiful,PG-13,Comedy,116,"[u'Roberto Benigni', u'Nicoletta Braschi', u'G..."
8.7,Interstellar,PG-13,Adventure,169,"[u'Matthew McConaughey', u'Anne Hathaway', u'J..."
8.8,The Lord of the Rings: The Fellowship of the Ring,PG-13,Adventure,178,"[u'Elijah Wood', u'Ian McKellen', u'Orlando Bl..."
8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."

In [16]:
movies.groupby('genre').get_group('name')

KeyError: 'name'

#### 27. What is the use of apply function in pandas?

In [ ]:
df.apply() >> the pandas apply function allows you to run
custom function on the values in a series or column of your pandas dataframe
or
Pandas. apply allow the users to pass a function and apply it on every
single value of the Pandas series

In [18]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.random.randint(1,20,size=(6,5)),columns= list('ABCDE'))
print(df)
def sqr(n):
    return n**2
df.apply(sqr)

    A   B   C   D   E
0   5  11   3  13   7
1  17  13   3  14   4
2   9   5  13   3   8
3  13  16   1  18   9
4  12   9  10   4   8
5   2   9   7  16  17

     A    B    C    D    E
0   25  121    9  169   49
1  289  169    9  196   16
2   81   25  169    9   64
3  169  256    1  324   81
4  144   81  100   16   64
5    4   81   49  256  289

#### 28. How to use apply() with lambda function?

In [19]:
df.apply(lambda x :x**2)

     A    B    C    D    E
0   25  121    9  169   49
1  289  169    9  196   16
2   81   25  169    9   64
3  169  256    1  324   81
4  144   81  100   16   64
5    4   81   49  256  289

In [20]:
df['A']=df['A'].apply(lambda x:x**2)
df

     A   B   C   D   E
0   25  11   3  13   7
1  289  13   3  14   4
2   81   5  13   3   8
3  169  16   1  18   9
4  144   9  10   4   8
5    4   9   7  16  17

#### 29. Explain is the use of info, describe, head, head, and tail functions

In [21]:
import numpy as np
import pandas as pd
df= pd.read_csv('movies_data.csv')
df

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 979 entries, 0 to 978
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   star_rating     979 non-null    float64
 1   title           979 non-null    object
 2   content_rating  976 non-null    object
 3   genre           979 non-null    object
 4   duration        979 non-null    int64
 5   actors_list     979 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 46.0+ KB

In [23]:
df.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [24]:
df.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [25]:
df.tail()

,star_rating,title,content_rating,genre,duration,actors_list
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

#### 30. Write a Pandas program to check whether only a title case is present in a given column of a DataFrame.

In [27]:
import pandas as pd
movies['title_istitle'] = list(map(lambda i : i.istitle(),movies['title']))
movies['title_istitle']

0       True
1       True
2      False
3       True
4       True
       ...
974     True
975    False
976    False
977     True
978     True
Name: title_istitle, Length: 979, dtype: bool

#### 31. What is the map Function In Pandas?

map values of series according to input correspondence.  
\* used for substrituting each value in a series with another value, that may be derived from a function , a dict or a series.  

---  syntax : Series.map(self,arg,na_action=None)

In [28]:
import pandas as pd
import numpy as np
df = pd.Series(['ABC','DFG','NaN','COG'])
df

0    ABC
1    DFG
2    NaN
3    COG
dtype: object

In [29]:
df.map({'Name':'Ganesh','From':'Karjat'})
df

0    ABC
1    DFG
2    NaN
3    COG
dtype: object

#### 32. How will you add a column to a pandas DataFrame?

In [5]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.random.randint(1,10,(3,5)),columns=['A','B','C','D','E'])
df['F'] = ('C')
df['G'] = ('D')
df

   A  B  C  D  E  F  G
0  2  2  5  1  4  C  D
1  6  3  5  9  3  C  D
2  2  9  5  5  1  C  D

#### 33. How will you add a column at a specific index to a pandas DataFrame?

In [8]:
df = pd.DataFrame(np.random.randint(1,10,size=(3,4)),columns=list('ABCD'))
df.insert(1,'G',['x','y','z'],allow_duplicates=True)
df

   A  G  B  C  D
0  7  x  5  1  8
1  1  y  5  1  8
2  8  z  1  8  4

#### 34. How to Delete Indices, Rows, or Columns From a Pandas DataFrame?

In [10]:
df = pd.DataFrame(np.random.randint(1,10,size=(3,4)),columns=list('ABCD'))
print(df)
del df['B']
df

   A  B  C  D
0  6  1  5  1
1  5  6  3  6
2  4  8  7  6

   A  C  D
0  6  5  1
1  5  3  6
2  4  7  6

In [17]:
df22 = pd.DataFrame(np.random.randint(1,6,size=(3,3)),columns=['A','B','C'])
print('Original df:\n',df22)
del df22['A'] # column deleted
df22.drop('B',axis=1, inplace=True) # column dropped
df22.drop(1,axis=0,inplace=True) # row deleted
display('Deleting column A ,B and row a:',df22)
display('By deleting indices:',df22.reset_index(drop=True))

Original df:
    A  B  C
0  4  4  4
1  5  1  1
2  3  1  4

'Deleting column A ,B and row a:'

   C
0  4
2  4

'By deleting indices:'

   C
0  4
1  4

#### 35. How to get the items not common to both series A and series B?

In [22]:
# df = pd.DataFrame(np.random.randint(10,99,(5,6)), columns=list('ABCDEF'))
# df
A=pd.Series([1,2,3,5,6])
B=pd.Series([2,3,4,5,6])
print(A,B)
union=pd.Series(np.union1d(A,B))
intersect=pd.Series(np.intersect1d(A,B))
notcommonseries = union[~union.isin(intersect)]
print(notcommonseries)

0    1
1    2
2    3
3    5
4    6
dtype: int64 0    2
1    3
2    4
3    5
4    6
dtype: int64
0    1
3    4
dtype: int64

#### 36. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?

In [23]:
S1 = pd.Series([1,2,3,4,5])
print('min:',S1.min())
print('max:',S1.max())
print('median:',S1.median())
result = np.percentile(S1, q=[0,20,50,75,100])
result

min: 1
max: 5
median: 3.0

array([1. , 1.8, 3. , 4. , 5. ])

#### 37. How can we sort the DataFrame?

In [27]:
array = np.random.randint(10,50,size=(5,4))
df = pd.DataFrame(array,columns=list('ABCD'),index=list('bdaec'))
print('orignal array:')
print(df)
df.sort_index(axis=0,inplace=True)
df

orignal array:
    A   B   C   D
b  39  16  43  39
d  18  12  42  40
a  31  28  26  16
e  14  43  32  42
c  38  27  34  13

    A   B   C   D
a  31  28  26  16
b  39  16  43  39
c  38  27  34  13
d  18  12  42  40
e  14  43  32  42

In [28]:
array = np.random.randint(10,50,size=(5,4))
df = pd.DataFrame(array,columns=list('CADB'),index=list('abcde'))
print('orignal array:')
print(df)
df.sort_index(axis=1,inplace=True)
df

orignal array:
    C   A   D   B
a  29  28  35  14
b  18  15  45  19
c  18  21  36  26
d  21  32  21  38
e  15  29  43  23

    A   B   C   D
a  28  14  29  35
b  15  19  18  45
c  21  26  18  36
d  32  38  21  21
e  29  23  15  43

#### 38. How to drop duplicate rows from DataFrame?

In [29]:
df = pd.DataFrame(np.array([[1,2,3],[1,2,3],[4,5,6]]),
columns=['n1','n2','n3'])
display(df)
display(df.duplicated()) # it finds duplicates and returns df with boolean s
display(df.drop_duplicates())

   n1  n2  n3
0   1   2   3
1   1   2   3
2   4   5   6

0    False
1     True
2    False
dtype: bool

   n1  n2  n3
0   1   2   3
2   4   5   6

#### 39. How to drop duplicate columns from DataFrame?

In [30]:
df = pd.DataFrame(np.array([[1,1,3],[2,2,3],[3,3,6]]),
columns=['n1','n2','n3'])
display('Original df:',df)
display('Transpose of df:',df.T) #just made transpose of df..to remove dupli
display('Drop duplicates:',df.T.drop_duplicates())
display('Converted to original:',df.T.drop_duplicates().T)

'Original df:'

   n1  n2  n3
0   1   1   3
1   2   2   3
2   3   3   6

'Transpose of df:'

    0  1  2
n1  1  2  3
n2  1  2  3
n3  3  3  6

'Drop duplicates:'

    0  1  2
n1  1  2  3
n3  3  3  6

'Converted to original:'

   n1  n3
0   1   3
1   2   3
2   3   6

#### 40. Write a Pandas program to split a string of a column of a given DataFrame into multiple columns(Split Name and Surname)

In [31]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'Name':['Ganesh Lad','Mahesh khadagle','pratik kamble'],
'Age':['27','28','30']})
print(df)
df[['First Name','Last_Name']]=df['Name'].str.split(' ',expand=True)
df

              Name Age
0       Ganesh Lad  27
1  Mahesh khadagle  28
2    pratik kamble  30

              Name Age First Name Last_Name
0       Ganesh Lad  27     Ganesh       Lad
1  Mahesh khadagle  28     Mahesh  khadagle
2    pratik kamble  30     pratik    kamble